app/views/payments/index.html.erb

SELECT `payments`.* FROM `payments` WHERE `payments`.`id` = 2
---
              <% end %>
              <% @payment = Payment.where(id:man[0].payment_id)[0]  %>