app/controllers/abouts_controller.rb

def index
  @about=About.last
  @jobs=Job.all
  @services = Service.all
  @quides = Quide.all
---
SELECT `abouts`.* FROM `abouts` ORDER BY `abouts`.`id` DESC LIMIT 1
SELECT `services`.* FROM `services`
SELECT `quides`.* FROM `quides` ORDER BY ochered