app/controllers/contact_controller.rb

SELECT `streets`.* FROM `streets` ORDER BY name
---
  def new

    @message = Message.new

    @str = []
    Street.all.each do |w|

SELECT `builds`.* FROM `builds` WHERE `builds`.`street_id` = 1 AND `builds`.`name` = '1' LIMIT 1
SELECT `streets`.* FROM `streets` WHERE `streets`.`id` = 1 LIMIT 1
---
  def create
    @message = Message.new(params[:message])

    @check_connect = CheckConnect.new(:add_time => Time.now,:fio => @message.name + " "+ @message.surname + " " + @message.patronymic, :house=>@message.house, :apartment=>@message.apartment, :email=>@message.email, :phone=>@message.phone, :message=>@message.message, :id_street=>@message.street)

    @jurnal = Jurnal.new(:date => Time.now, :doc_name => "add_check_connect", :arxiv => 1, :comment => @message.message, :doc_type => "operator", :operator => 0)

    if Street.find(@message.street).builds.find_by_name(@message.house).present?