app/controllers/pages_controller.rb

  def index
    @pages = Page.where("start_at < ? ", Time.now).where("finish_at > ? ", Time.now).where(:on => true)
    @post_calendar = Post.where(post_type_id:1).last
    @post_break = Post.where(post_type_id:2).last
    @about = About.first
---
SELECT `pages`.* FROM `pages` WHERE `pages`.`on` = 1 AND (start_at < '2013-07-29 13:57:26' ) AND (finish_at > '2013-07-29 13:57:26' )
SELECT `posts`.* FROM `posts` WHERE `posts`.`post_type_id` = 1 ORDER BY `posts`.`id` DESC LIMIT 1
SELECT `abouts`.* FROM `abouts` LIMIT 1