app/controllers/payments_controller.rb

  def index
    @payments=Payment.all
    @manuals = Manual.all
    @manes = Manual.find_all_by_ochered(1)
    @types =Type.all
---
SELECT `payments`.* FROM `payments`
SELECT `manuals`.* FROM `manuals` WHERE `manuals`.`payment_id` = 2
SELECT `manuals`.* FROM `manuals` WHERE `manuals`.`ochered` = 1
SELECT `types`.* FROM `types`