app/controllers/posts_controller.rb

SELECT `posts`.* FROM `posts` ORDER BY created_at DESC LIMIT 9 OFFSET 0
---
  def index
    @posts = Post.paginate(:page => params[:page], :per_page => 3)