app/views/contact/_form.html.erb

SELECT `streets`.* FROM `streets` ORDER BY name
---
    <select name="message[street]" class="default" id="message_street" include_blank="true">
      <%= Street.order(:name).all.each do |st| %>