app/views/quides/_b.html.erb

    <ul id="mycarousel">
      <% @quides = Quide.order('ochered') %>
---
SELECT `quides`.* FROM `quides` ORDER BY ochered