app/views/notifications_mailer/new_message.text.erb

SELECT `streets`.* FROM `streets` WHERE `streets`.`id` = 1 LIMIT 1
---

Улица:       <%= Street.find(@message.street).name %>